Revit 2027 API
EnergyDataSettings.AnalyticalSurfaceResolution Property
 Analytical Surface Resolution defines the smallest dimension of any surface to be included in the energy analytical model. This setting is ignored if AnalysisType is RoomsOrSpaces.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double AnalyticalSurfaceResolution { get; set; }
Public Property AnalyticalSurfaceResolution As Double
	Get
	Set
public:
property double AnalyticalSurfaceResolution {
	double get ();
	void set (double value);
}
member AnalyticalSurfaceResolution : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property:
Remarks
 The resolution should be less than the smallest dimension of any surface to be included in the energy analytical model.
See Also
Reference
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace